#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
data.oci_identity_availability_domains.ads: Reading...
module.network.data.oci_identity_availability_domains.ads: Reading...
data.oci_identity_tenancy.current: Reading...
module.compute_standard.data.oci_core_images.oracle_linux: Reading...
module.network.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-374658999]
data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-374658999]
data.oci_identity_tenancy.current: Read complete after 1s [id=ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq]
module.compute_standard.data.oci_core_images.oracle_linux: Read complete after 1s [id=CoreImagesDataSource-3738586213]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute_standard.oci_core_instance.vps_standard will be created
  + resource "oci_core_instance" "vps_standard" {
      + availability_domain                 = "utUB:SA-SAOPAULO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "pablo-web-vps-standard"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Environment" = "production"
          + "Purpose"     = "web-hosting"
          + "Terraform"   = "true"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHEFImsG1JjL2RBAQozXxu+YbAuX37ur6x9yswGJeaVF personal_ed"
          + "user_data"           = "I2Nsb3VkLWNvbmZpZwp1c2VyczoKICAtIG5hbWU6IG9wYwogICAgc3NoLWF1dGhvcml6ZWQta2V5czoKICAgICAgLSBzc2gtZWQyNTUxOSBBQUFBQzNOemFDMWxaREkxTlRFNUFBQUFJSEVGSW1zRzFKakwyUkJBUW96WHh1K1liQXVYMzd1cjZ4OXlzd0dKZWFWRiBwZXJzb25hbF9lZApwYWNrYWdlX3VwZGF0ZTogZmFsc2UKcGFja2FnZV91cGdyYWRlOiBmYWxzZQpwYWNrYWdlczoKICAtIHBvZG1hbgpydW5jbWQ6CiAgLSBwb2RtYW4gcHVsbCBkb2NrZXIuaW8vUGFibG9CZXJyZXR0b25pL1BvcnRmb2xpbwogIC0gcG9kbWFuIHJ1biAtZCAtLW5hbWUgcG9ydGZvbGlvIC1wIDgwOjgwIC1wIDQ0Mzo0NDMgZG9ja2VyLmlvL1BhYmxvQmVycmV0dG9uaS9Qb3J0Zm9saW8="
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = "pablo-web-vps-standard-vnic"
          + freeform_tags             = (known after apply)
          + hostname_label            = "pablovps-standard"
          + nsg_ids                   = (known after apply)
          + private_ip                = (known after apply)
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_id                 = (known after apply)
          + vlan_id                   = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.sa-saopaulo-1.aaaaaaaac6ucdr5nmsgd4ygfwngqyjyofoxir6n2gouu4yncymatohu77lxq"
          + source_type             = "image"
        }
    }

  # module.network.oci_core_default_route_table.main will be created
  + resource "oci_core_default_route_table" "main" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "pablo-web-vps-rt"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.network.oci_core_default_security_list.main will be created
  + resource "oci_core_default_security_list" "main" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "pablo-web-vps-sl"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # module.network.oci_core_internet_gateway.main will be created
  + resource "oci_core_internet_gateway" "main" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + defined_tags   = (known after apply)
      + display_name   = "pablo-web-vps-igw"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.network.oci_core_subnet.public will be created
  + resource "oci_core_subnet" "public" {
      + availability_domain        = "utUB:SA-SAOPAULO-1-AD-1"
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "pablo-web-vps-public-subnet"
      + dns_label                  = "public"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_vcn.main will be created
  + resource "oci_core_vcn" "main" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "pablo-web-vps-vcn"
      + dns_label                        = "mainvcn"
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssh_command    = (known after apply)
  + subnet_id      = (known after apply)
  + tenancy_name   = "clep0"
  + vcn_id         = (known after apply)
  + vps_private_ip = (known after apply)
  + vps_public_ip  = (known after apply)
  + website_url    = "https://pabloberrettoni.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_771c4d16-615d-40bf-a89a-92779f8fb0e5
data.oci_identity_availability_domains.ads: Reading...
module.network.data.oci_identity_availability_domains.ads: Reading...
data.oci_identity_tenancy.current: Reading...
module.compute_standard.data.oci_core_images.oracle_linux: Reading...
module.network.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-374658999]
data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-374658999]
data.oci_identity_tenancy.current: Read complete after 1s [id=ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq]
module.compute_standard.data.oci_core_images.oracle_linux: Read complete after 1s [id=CoreImagesDataSource-3738586213]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute_standard.oci_core_instance.vps_standard will be created
  + resource "oci_core_instance" "vps_standard" {
      + availability_domain                 = "utUB:SA-SAOPAULO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "pablo-web-vps-standard"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Environment" = "production"
          + "Purpose"     = "web-hosting"
          + "Terraform"   = "true"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHEFImsG1JjL2RBAQozXxu+YbAuX37ur6x9yswGJeaVF personal_ed"
          + "user_data"           = "I2Nsb3VkLWNvbmZpZwp1c2VyczoKICAtIG5hbWU6IG9wYwogICAgc3NoLWF1dGhvcml6ZWQta2V5czoKICAgICAgLSBzc2gtZWQyNTUxOSBBQUFBQzNOemFDMWxaREkxTlRFNUFBQUFJSEVGSW1zRzFKakwyUkJBUW96WHh1K1liQXVYMzd1cjZ4OXlzd0dKZWFWRiBwZXJzb25hbF9lZApwYWNrYWdlX3VwZGF0ZTogZmFsc2UKcGFja2FnZV91cGdyYWRlOiBmYWxzZQpwYWNrYWdlczoKICAtIHBvZG1hbgpydW5jbWQ6CiAgLSBwb2RtYW4gcHVsbCBkb2NrZXIuaW8vUGFibG9CZXJyZXR0b25pL1BvcnRmb2xpbwogIC0gcG9kbWFuIHJ1biAtZCAtLW5hbWUgcG9ydGZvbGlvIC1wIDgwOjgwIC1wIDQ0Mzo0NDMgZG9ja2VyLmlvL1BhYmxvQmVycmV0dG9uaS9Qb3J0Zm9saW8="
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = "pablo-web-vps-standard-vnic"
          + freeform_tags             = (known after apply)
          + hostname_label            = "pablovps-standard"
          + nsg_ids                   = (known after apply)
          + private_ip                = (known after apply)
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_id                 = (known after apply)
          + vlan_id                   = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.sa-saopaulo-1.aaaaaaaac6ucdr5nmsgd4ygfwngqyjyofoxir6n2gouu4yncymatohu77lxq"
          + source_type             = "image"
        }
    }

  # module.network.oci_core_default_route_table.main will be created
  + resource "oci_core_default_route_table" "main" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "pablo-web-vps-rt"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.network.oci_core_default_security_list.main will be created
  + resource "oci_core_default_security_list" "main" {
      + compartment_id             = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "pablo-web-vps-sl"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + manage_default_resource_id = (known after apply)
      + state                      = (known after apply)
      + time_created               = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # module.network.oci_core_internet_gateway.main will be created
  + resource "oci_core_internet_gateway" "main" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + defined_tags   = (known after apply)
      + display_name   = "pablo-web-vps-igw"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.network.oci_core_subnet.public will be created
  + resource "oci_core_subnet" "public" {
      + availability_domain        = "utUB:SA-SAOPAULO-1-AD-1"
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "pablo-web-vps-public-subnet"
      + dns_label                  = "public"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_vcn.main will be created
  + resource "oci_core_vcn" "main" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaaebyaeey7fj3lyct6xxdvmtspn5dbh5cxtcxmlp5ppxsgxpz5jfkq"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "pablo-web-vps-vcn"
      + dns_label                        = "mainvcn"
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssh_command    = (known after apply)
  + subnet_id      = (known after apply)
  + tenancy_name   = "clep0"
  + vcn_id         = (known after apply)
  + vps_private_ip = (known after apply)
  + vps_public_ip  = (known after apply)
  + website_url    = "https://pabloberrettoni.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_771c4d16-615d-40bf-a89a-92779f8fb0e5
stderr<<ghadelimiter_a1d84059-96a6-445e-9793-d85d3d0067a6

ghadelimiter_a1d84059-96a6-445e-9793-d85d3d0067a6
exitcode<<ghadelimiter_3da3af30-6bcd-4bf9-a7e8-555d1c534ec0
0
ghadelimiter_3da3af30-6bcd-4bf9-a7e8-555d1c534ec0
```

</details>

*Pusher: @PabloBerrettoni, Action: `pull_request`*